hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * ARMING (RW)
 *
 * Wait for trigger before excuting
 * 0: Execute on enable
 * 1: Wait trigger before exection after enabled
 */
#define SEI_CTRL_ENGINE_CTRL_ARMING_MASK (0x10000UL)
#define SEI_CTRL_ENGINE_CTRL_ARMING_SHIFT (16U)
#define SEI_CTRL_ENGINE_CTRL_ARMING_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_ARMING_SHIFT) & SEI_CTRL_ENGINE_CTRL_ARMING_MASK)
#define SEI_CTRL_ENGINE_CTRL_ARMING_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_CTRL_ARMING_MASK) >> SEI_CTRL_ENGINE_CTRL_ARMING_SHIFT)

/*
 * EXCEPT (RW)
 *
 * Explain timout as exception
 * 0: when timeout, pointer move to next instruction
 * 1: when timeout, pointer jump to timeout vector
 */
#define SEI_CTRL_ENGINE_CTRL_EXCEPT_MASK (0x100U)
#define SEI_CTRL_ENGINE_CTRL_EXCEPT_SHIFT (8U)
#define SEI_CTRL_ENGINE_CTRL_EXCEPT_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_EXCEPT_SHIFT) & SEI_CTRL_ENGINE_CTRL_EXCEPT_MASK)
#define SEI_CTRL_ENGINE_CTRL_EXCEPT_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_CTRL_EXCEPT_MASK) >> SEI_CTRL_ENGINE_CTRL_EXCEPT_SHIFT)

/*
 * REWIND (RW)
 *
 * Rewind execution pointer
 * 0: run
 * 1: clean status and rewind
 */
#define SEI_CTRL_ENGINE_CTRL_REWIND_MASK (0x10U)
#define SEI_CTRL_ENGINE_CTRL_REWIND_SHIFT (4U)
#define SEI_CTRL_ENGINE_CTRL_REWIND_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_REWIND_SHIFT) & SEI_CTRL_ENGINE_CTRL_REWIND_MASK)
#define SEI_CTRL_ENGINE_CTRL_REWIND_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_CTRL_REWIND_MASK) >> SEI_CTRL_ENGINE_CTRL_REWIND_SHIFT)

/*
 * ENABLE (RW)
 *
 * Enable
 * 0: disable
 * 1: enable
 */
#define SEI_CTRL_ENGINE_CTRL_ENABLE_MASK (0x1U)
#define SEI_CTRL_ENGINE_CTRL_ENABLE_SHIFT (0U)
#define SEI_CTRL_ENGINE_CTRL_ENABLE_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_ENABLE_SHIFT) & SEI_CTRL_ENGINE_CTRL_ENABLE_MASK)
#define SEI_CTRL_ENGINE_CTRL_ENABLE_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_CTRL_ENABLE_MASK) >> SEI_CTRL_ENGINE_CTRL_ENABLE_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTR_CFG */
/*
 * DAT_CDM (RW)
 *
 * Select DATA register to receive CDM bit in BiSSC slave mode
 * 0: ignore
 * 1: command
 * 2: data register 2
 * 3: data register 3
 * ...
 * 29:data register 29
 * 30: value 0 when send, ignore in receive
 * 31: value1 when send, ignore in receive
 */
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_MASK (0x1F000000UL)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_SHIFT (24U)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_SHIFT) & SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_MASK)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_MASK) >> SEI_CTRL_ENGINE_PTR_CFG_DAT_CDM_SHIFT)

/*
 * DAT_BASE (RW)
 *
 * Bias for data register access, if calculated index bigger than 32, index will wrap around
 * 0: real data index
 * 1: access index is 1 greater than instruction address
 * 2: access index is 2 greater than instruction address
 * ...
 * 31: access index is 31 greater than instruction address
 */
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_MASK (0x1F0000UL)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_SHIFT (16U)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_SHIFT) & SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_MASK)
#define SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_MASK) >> SEI_CTRL_ENGINE_PTR_CFG_DAT_BASE_SHIFT)

/*
 * POINTER_WDOG (RW)
 *
 * Pointer to the instruction that the program starts executing after the instruction timeout. The timeout is WDOG_TIME
 */
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_MASK (0xFF00U)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_SHIFT (8U)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_SHIFT) & SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_MASK)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_MASK) >> SEI_CTRL_ENGINE_PTR_CFG_POINTER_WDOG_SHIFT)

/*
 * POINTER_INIT (RW)
 *
 * Initial execute pointer
 */
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_MASK (0xFFU)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_SHIFT (0U)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_SHIFT) & SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_MASK)
#define SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_MASK) >> SEI_CTRL_ENGINE_PTR_CFG_POINTER_INIT_SHIFT)

/* Bitfield definition for register of struct array CTRL: WDG_CFG */
/*
 * WDOG_TIME (RW)
 *
 * Time out count for each instruction, counter in bit time.
 */
#define SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_MASK (0xFFFFU)
#define SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_SHIFT (0U)
#define SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_SHIFT) & SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_MASK)
#define SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_MASK) >> SEI_CTRL_ENGINE_WDG_CFG_WDOG_TIME_SHIFT)

/* Bitfield definition for register of struct array CTRL: EXE_STA */
/*
 * TRIGERED (RO)
 *
 * Execution has been triggered
 * 0: Execution not triggered
 * 1: Execution triggered
 */
#define SEI_CTRL_ENGINE_EXE_STA_TRIGERED_MASK (0x100000UL)
#define SEI_CTRL_ENGINE_EXE_STA_TRIGERED_SHIFT (20U)
#define SEI_CTRL_ENGINE_EXE_STA_TRIGERED_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_STA_TRIGERED_MASK) >> SEI_CTRL_ENGINE_EXE_STA_TRIGERED_SHIFT)

/*
 * ARMED (RO)
 *
 * Waiting for trigger for execution
 * 0: Not in waiting status
 * 1: In waiting status
 */
#define SEI_CTRL_ENGINE_EXE_STA_ARMED_MASK (0x10000UL)
#define SEI_CTRL_ENGINE_EXE_STA_ARMED_SHIFT (16U)
#define SEI_CTRL_ENGINE_EXE_STA_ARMED_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_STA_ARMED_MASK) >> SEI_CTRL_ENGINE_EXE_STA_ARMED_SHIFT)

/*
 * EXPIRE (RO)
 *
 * Watchdog timer expired
 * 0: Not expired
 * 1: Expired
 */
#define SEI_CTRL_ENGINE_EXE_STA_EXPIRE_MASK (0x100U)
#define SEI_CTRL_ENGINE_EXE_STA_EXPIRE_SHIFT (8U)
#define SEI_CTRL_ENGINE_EXE_STA_EXPIRE_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_STA_EXPIRE_MASK) >> SEI_CTRL_ENGINE_EXE_STA_EXPIRE_SHIFT)

