hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * DA_IDLEZ (RW)
 *
 * Idle state driver of data line
 * 0: output
 * 1: high-Z
 */
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_MASK (0x8U)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_SHIFT (3U)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEZ_SHIFT)

/*
 * CK_IDLEZ (RW)
 *
 * Idle state driver of clock line
 * 0: output
 * 1: high-Z
 */
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_MASK (0x4U)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_SHIFT (2U)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEZ_SHIFT)

/*
 * DA_IDLEV (RW)
 *
 * Idle state value of data line
 * 0: data'0'
 * 1: data'1'
 */
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_MASK (0x2U)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_SHIFT (1U)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_DA_IDLEV_SHIFT)

/*
 * CK_IDLEV (RW)
 *
 * Idle state value of clock line
 * 0: data'0'
 * 1: data'1'
 */
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_MASK (0x1U)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_SHIFT (0U)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_CK_IDLEV_SHIFT)

/* Bitfield definition for register of struct array CTRL: BAUD_CFG */
/*
 * SYNC_POINT (RW)
 *
 * Baud synchronous time, minmum bit time
 */
#define SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_MASK (0xFFFF0000UL)
#define SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_SHIFT (16U)
#define SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_SHIFT) & SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_MASK)
#define SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_MASK) >> SEI_CTRL_XCVR_BAUD_CFG_SYNC_POINT_SHIFT)

/*
 * BAUD_DIV (RW)
 *
 * Baud rate, bit time in system clock cycle
 */
#define SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_MASK (0xFFFFU)
#define SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_SHIFT (0U)
#define SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_SHIFT) & SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_MASK)
#define SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_MASK) >> SEI_CTRL_XCVR_BAUD_CFG_BAUD_DIV_SHIFT)

/* Bitfield definition for register of struct array CTRL: DATA_CFG */
/*
 * TXD_POINT (RW)
 *
 * data transmit point  in system clcok cycle
 */
#define SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_MASK (0xFFFF0000UL)
#define SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_SHIFT (16U)
#define SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_SHIFT) & SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_MASK)
#define SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_MASK) >> SEI_CTRL_XCVR_DATA_CFG_TXD_POINT_SHIFT)

/*
 * RXD_POINT (RW)
 *
 * data receive point in system clcok cycle
 */
#define SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_MASK (0xFFFFU)
#define SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_SHIFT (0U)
#define SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_SHIFT) & SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_MASK)
#define SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_MASK) >> SEI_CTRL_XCVR_DATA_CFG_RXD_POINT_SHIFT)

/* Bitfield definition for register of struct array CTRL: CLK_CFG */
/*
 * CK1_POINT (RW)
 *
 * clock point 1 in system clcok cycle
 */
#define SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_MASK (0xFFFF0000UL)
#define SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_SHIFT (16U)
#define SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_SHIFT) & SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_MASK)
#define SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_MASK) >> SEI_CTRL_XCVR_CLK_CFG_CK1_POINT_SHIFT)

/*
 * CK0_POINT (RW)
 *
 * clock point 0 in system clcok cycle
 */
#define SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_MASK (0xFFFFU)
#define SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_SHIFT (0U)
#define SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_SHIFT) & SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_MASK)
#define SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_MASK) >> SEI_CTRL_XCVR_CLK_CFG_CK0_POINT_SHIFT)

/* Bitfield definition for register of struct array CTRL: PIN */
/*
 * OE_CK (RO)
 *
 * CK drive state
 * 0: input
 * 1: output
 */
#define SEI_CTRL_XCVR_PIN_OE_CK_MASK (0x4000000UL)
#define SEI_CTRL_XCVR_PIN_OE_CK_SHIFT (26U)
#define SEI_CTRL_XCVR_PIN_OE_CK_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_OE_CK_MASK) >> SEI_CTRL_XCVR_PIN_OE_CK_SHIFT)

/*
 * DI_CK (RO)
 *
 * CK state
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DI_CK_MASK (0x2000000UL)
#define SEI_CTRL_XCVR_PIN_DI_CK_SHIFT (25U)
#define SEI_CTRL_XCVR_PIN_DI_CK_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DI_CK_MASK) >> SEI_CTRL_XCVR_PIN_DI_CK_SHIFT)

/*
 * DO_CK (RO)
 *
 * CK output
 * 0: data 0
 * 1: data 1
 */
#define SEI_CTRL_XCVR_PIN_DO_CK_MASK (0x1000000UL)
#define SEI_CTRL_XCVR_PIN_DO_CK_SHIFT (24U)
#define SEI_CTRL_XCVR_PIN_DO_CK_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_DO_CK_MASK) >> SEI_CTRL_XCVR_PIN_DO_CK_SHIFT)

/*
 * OE_RX (RO)
 *
 * RX drive state
 * 0: input
 * 1: output
 */
#define SEI_CTRL_XCVR_PIN_OE_RX_MASK (0x40000UL)
#define SEI_CTRL_XCVR_PIN_OE_RX_SHIFT (18U)
#define SEI_CTRL_XCVR_PIN_OE_RX_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_PIN_OE_RX_MASK) >> SEI_CTRL_XCVR_PIN_OE_RX_SHIFT)

