hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * OUT0_SEL (RW)
 *
 * Trigger 0 sigal selection
 * 0: trigger out 0
 * 1: trigger out 1
 * ...
 * 7: trigger out 7
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK (0x7U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT (0U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: IN_DIV */
/*
 * IN1_DIV (RW)
 *
 * The divider of trigger in 1.
 * 0x0: disable divider
 * 0x1: divider by 2
 * 0x2: divider by 3
 * ...
 * 0xFF: divider by 256
 */
#define SEI_CTRL_TRG_IN_DIV_IN1_DIV_MASK (0xFF00U)
#define SEI_CTRL_TRG_IN_DIV_IN1_DIV_SHIFT (8U)
#define SEI_CTRL_TRG_IN_DIV_IN1_DIV_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_DIV_IN1_DIV_SHIFT) & SEI_CTRL_TRG_IN_DIV_IN1_DIV_MASK)
#define SEI_CTRL_TRG_IN_DIV_IN1_DIV_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_DIV_IN1_DIV_MASK) >> SEI_CTRL_TRG_IN_DIV_IN1_DIV_SHIFT)

/*
 * IN0_DIV (RW)
 *
 * The divider of trigger in 0.
 * 0x0: disable divider
 * 0x1: divider by 2
 * 0x2: divider by 3
 * ...
 * 0xFF: divider by 256
 */
#define SEI_CTRL_TRG_IN_DIV_IN0_DIV_MASK (0xFFU)
#define SEI_CTRL_TRG_IN_DIV_IN0_DIV_SHIFT (0U)
#define SEI_CTRL_TRG_IN_DIV_IN0_DIV_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_DIV_IN0_DIV_SHIFT) & SEI_CTRL_TRG_IN_DIV_IN0_DIV_MASK)
#define SEI_CTRL_TRG_IN_DIV_IN0_DIV_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_DIV_IN0_DIV_MASK) >> SEI_CTRL_TRG_IN_DIV_IN0_DIV_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD_STS */
/*
 * TRIGERED (RO)
 *
 * Period has been triggered
 * 0: Not triggered
 * 1: Triggered
 */
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_MASK (0x100000UL)
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_SHIFT (20U)
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_STS_TRIGERED_MASK) >> SEI_CTRL_TRG_PRD_STS_TRIGERED_SHIFT)

/*
 * ARMED (RO)
 *
 * Waiting for trigger
 * 0: Not in waiting status
 * 1: In waiting status
 */
#define SEI_CTRL_TRG_PRD_STS_ARMED_MASK (0x10000UL)
#define SEI_CTRL_TRG_PRD_STS_ARMED_SHIFT (16U)
#define SEI_CTRL_TRG_PRD_STS_ARMED_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_STS_ARMED_MASK) >> SEI_CTRL_TRG_PRD_STS_ARMED_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD_CNT */
/*
 * PERIOD_CNT (RO)
 *
 * Trigger period counter
 */
#define SEI_CTRL_TRG_PRD_CNT_PERIOD_CNT_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_TRG_PRD_CNT_PERIOD_CNT_SHIFT (0U)
#define SEI_CTRL_TRG_PRD_CNT_PERIOD_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_CNT_PERIOD_CNT_MASK) >> SEI_CTRL_TRG_PRD_CNT_PERIOD_CNT_SHIFT)

/* Bitfield definition for register of struct array CTRL: DIV_STS */
/*
 * IN1_CNT (RO)
 *
 * The divider counter for trigger in 1, trigger valid when counter is 0.
 */
#define SEI_CTRL_TRG_DIV_STS_IN1_CNT_MASK (0xFF00U)
#define SEI_CTRL_TRG_DIV_STS_IN1_CNT_SHIFT (8U)
#define SEI_CTRL_TRG_DIV_STS_IN1_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_DIV_STS_IN1_CNT_MASK) >> SEI_CTRL_TRG_DIV_STS_IN1_CNT_SHIFT)

/*
 * IN0_CNT (RO)
 *
 * The divider counter for trigger in 0, trigger valid when counter is 0.
 */
#define SEI_CTRL_TRG_DIV_STS_IN0_CNT_MASK (0xFFU)
#define SEI_CTRL_TRG_DIV_STS_IN0_CNT_SHIFT (0U)
#define SEI_CTRL_TRG_DIV_STS_IN0_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_DIV_STS_IN0_CNT_MASK) >> SEI_CTRL_TRG_DIV_STS_IN0_CNT_SHIFT)

/* Bitfield definition for register of struct array CTRL: 0 */
/*
 * CMD_TRIGGER0 (RW)
 *
 * Trigger command
 */
#define SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_SHIFT (0U)
#define SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_SHIFT) & SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_MASK)
#define SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_MASK) >> SEI_CTRL_TRG_TABLE_CMD_CMD_TRIGGER0_SHIFT)

/* Bitfield definition for register of struct array CTRL: 0 */
/*
 * TRIGGER0_TIME (RO)
 *
 * Trigger time
 */
#define SEI_CTRL_TRG_TABLE_TIME_TRIGGER0_TIME_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_TRG_TABLE_TIME_TRIGGER0_TIME_SHIFT (0U)
#define SEI_CTRL_TRG_TABLE_TIME_TRIGGER0_TIME_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_TABLE_TIME_TRIGGER0_TIME_MASK) >> SEI_CTRL_TRG_TABLE_TIME_TRIGGER0_TIME_SHIFT)

/* Bitfield definition for register of struct array CTRL: MODE */
/*
 * WLEN (RW)
 *
 * word length
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 31: 32 bit
 */
#define SEI_CTRL_CMD_MODE_WLEN_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_MODE_WLEN_SHIFT (16U)
#define SEI_CTRL_CMD_MODE_WLEN_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_WLEN_SHIFT) & SEI_CTRL_CMD_MODE_WLEN_MASK)
#define SEI_CTRL_CMD_MODE_WLEN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_WLEN_MASK) >> SEI_CTRL_CMD_MODE_WLEN_SHIFT)

/*
 * WORDER (RW)
 *
 * word order
 * 0: sample as bit order
 * 1: different from bit order
 */
#define SEI_CTRL_CMD_MODE_WORDER_MASK (0x800U)
#define SEI_CTRL_CMD_MODE_WORDER_SHIFT (11U)
#define SEI_CTRL_CMD_MODE_WORDER_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_WORDER_SHIFT) & SEI_CTRL_CMD_MODE_WORDER_MASK)
#define SEI_CTRL_CMD_MODE_WORDER_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_WORDER_MASK) >> SEI_CTRL_CMD_MODE_WORDER_SHIFT)

/*
 * BORDER (RW)
 *
 * bit order
 * 0: LSB first
 * 1: MSB first
 */
#define SEI_CTRL_CMD_MODE_BORDER_MASK (0x400U)
#define SEI_CTRL_CMD_MODE_BORDER_SHIFT (10U)
#define SEI_CTRL_CMD_MODE_BORDER_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_BORDER_SHIFT) & SEI_CTRL_CMD_MODE_BORDER_MASK)
#define SEI_CTRL_CMD_MODE_BORDER_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_BORDER_MASK) >> SEI_CTRL_CMD_MODE_BORDER_SHIFT)

/*
 * SIGNED (RW)
 *
 * Signed
 * 0: unsigned value
 * 1: signed value
 */
#define SEI_CTRL_CMD_MODE_SIGNED_MASK (0x200U)
#define SEI_CTRL_CMD_MODE_SIGNED_SHIFT (9U)
#define SEI_CTRL_CMD_MODE_SIGNED_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_SIGNED_SHIFT) & SEI_CTRL_CMD_MODE_SIGNED_MASK)
#define SEI_CTRL_CMD_MODE_SIGNED_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_SIGNED_MASK) >> SEI_CTRL_CMD_MODE_SIGNED_SHIFT)

