hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * REWIND (WC)
 *
 * Write 1 to rewind read/write pointer, this is a self clear bit
 */
#define SEI_CTRL_CMD_MODE_REWIND_MASK (0x100U)
#define SEI_CTRL_CMD_MODE_REWIND_SHIFT (8U)
#define SEI_CTRL_CMD_MODE_REWIND_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_REWIND_SHIFT) & SEI_CTRL_CMD_MODE_REWIND_MASK)
#define SEI_CTRL_CMD_MODE_REWIND_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_REWIND_MASK) >> SEI_CTRL_CMD_MODE_REWIND_SHIFT)

/*
 * MODE (RW)
 *
 * Data mode(CMD register only support data mode)
 * 0: data mode
 * 1: check mode
 * 2: CRC mode
 */
#define SEI_CTRL_CMD_MODE_MODE_MASK (0x3U)
#define SEI_CTRL_CMD_MODE_MODE_SHIFT (0U)
#define SEI_CTRL_CMD_MODE_MODE_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_MODE_SHIFT) & SEI_CTRL_CMD_MODE_MODE_MASK)
#define SEI_CTRL_CMD_MODE_MODE_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_MODE_MASK) >> SEI_CTRL_CMD_MODE_MODE_SHIFT)

/* Bitfield definition for register of struct array CTRL: IDX */
/*
 * LAST_BIT (RW)
 *
 * Last bit index for tranceive
 */
#define SEI_CTRL_CMD_IDX_LAST_BIT_MASK (0x1F000000UL)
#define SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT (24U)
#define SEI_CTRL_CMD_IDX_LAST_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT) & SEI_CTRL_CMD_IDX_LAST_BIT_MASK)
#define SEI_CTRL_CMD_IDX_LAST_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_LAST_BIT_MASK) >> SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT)

/*
 * FIRST_BIT (RW)
 *
 * First bit index for tranceive
 */
#define SEI_CTRL_CMD_IDX_FIRST_BIT_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT (16U)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT) & SEI_CTRL_CMD_IDX_FIRST_BIT_MASK)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_FIRST_BIT_MASK) >> SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT)

/*
 * MAX_BIT (RW)
 *
 * Highest bit index
 */
#define SEI_CTRL_CMD_IDX_MAX_BIT_MASK (0x1F00U)
#define SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT (8U)
#define SEI_CTRL_CMD_IDX_MAX_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT) & SEI_CTRL_CMD_IDX_MAX_BIT_MASK)
#define SEI_CTRL_CMD_IDX_MAX_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_MAX_BIT_MASK) >> SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT)

/*
 * MIN_BIT (RW)
 *
 * Lowest bit index
 */
#define SEI_CTRL_CMD_IDX_MIN_BIT_MASK (0x1FU)
#define SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT (0U)
#define SEI_CTRL_CMD_IDX_MIN_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT) & SEI_CTRL_CMD_IDX_MIN_BIT_MASK)
#define SEI_CTRL_CMD_IDX_MIN_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_MIN_BIT_MASK) >> SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT)

/* Bitfield definition for register of struct array CTRL: CMD */
/*
 * DATA (RW)
 *
 * DATA
 */
#define SEI_CTRL_CMD_CMD_DATA_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_CMD_DATA_SHIFT (0U)
#define SEI_CTRL_CMD_CMD_DATA_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_CMD_DATA_SHIFT) & SEI_CTRL_CMD_CMD_DATA_MASK)
#define SEI_CTRL_CMD_CMD_DATA_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_CMD_DATA_MASK) >> SEI_CTRL_CMD_CMD_DATA_SHIFT)

/* Bitfield definition for register of struct array CTRL: SET */
/*
 * DATA_SET (RW)
 *
 * DATA bit set
 */
#define SEI_CTRL_CMD_SET_DATA_SET_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_SET_DATA_SET_SHIFT (0U)
#define SEI_CTRL_CMD_SET_DATA_SET_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_SET_DATA_SET_SHIFT) & SEI_CTRL_CMD_SET_DATA_SET_MASK)
#define SEI_CTRL_CMD_SET_DATA_SET_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_SET_DATA_SET_MASK) >> SEI_CTRL_CMD_SET_DATA_SET_SHIFT)

/* Bitfield definition for register of struct array CTRL: CLR */
/*
 * DATA_CLR (RW)
 *
 * DATA bit clear
 */
#define SEI_CTRL_CMD_CLR_DATA_CLR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT (0U)
#define SEI_CTRL_CMD_CLR_DATA_CLR_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT) & SEI_CTRL_CMD_CLR_DATA_CLR_MASK)
#define SEI_CTRL_CMD_CLR_DATA_CLR_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_CLR_DATA_CLR_MASK) >> SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT)

/* Bitfield definition for register of struct array CTRL: INV */
/*
 * DATA_TGL (RW)
 *
 * DATA bit toggle
 */
#define SEI_CTRL_CMD_INV_DATA_TGL_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_INV_DATA_TGL_SHIFT (0U)
#define SEI_CTRL_CMD_INV_DATA_TGL_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_INV_DATA_TGL_SHIFT) & SEI_CTRL_CMD_INV_DATA_TGL_MASK)
#define SEI_CTRL_CMD_INV_DATA_TGL_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_INV_DATA_TGL_MASK) >> SEI_CTRL_CMD_INV_DATA_TGL_SHIFT)

/* Bitfield definition for register of struct array CTRL: IN */
/*
 * DATA_IN (RO)
 *
 * Commad input
 */
#define SEI_CTRL_CMD_IN_DATA_IN_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_IN_DATA_IN_SHIFT (0U)
#define SEI_CTRL_CMD_IN_DATA_IN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IN_DATA_IN_MASK) >> SEI_CTRL_CMD_IN_DATA_IN_SHIFT)

/* Bitfield definition for register of struct array CTRL: OUT */
/*
 * DATA_OUT (RO)
 *
 * Command output
 */
#define SEI_CTRL_CMD_OUT_DATA_OUT_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_OUT_DATA_OUT_SHIFT (0U)
#define SEI_CTRL_CMD_OUT_DATA_OUT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_OUT_DATA_OUT_MASK) >> SEI_CTRL_CMD_OUT_DATA_OUT_SHIFT)

/* Bitfield definition for register of struct array CTRL: STS */
/*
 * WORD_IDX (RO)
 *
 * Word index
 */
#define SEI_CTRL_CMD_STS_WORD_IDX_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_STS_WORD_IDX_SHIFT (16U)
#define SEI_CTRL_CMD_STS_WORD_IDX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_WORD_IDX_MASK) >> SEI_CTRL_CMD_STS_WORD_IDX_SHIFT)

/*
 * WORD_CNT (RO)
 *
 * Word counter
 */
#define SEI_CTRL_CMD_STS_WORD_CNT_MASK (0x1F00U)
#define SEI_CTRL_CMD_STS_WORD_CNT_SHIFT (8U)
#define SEI_CTRL_CMD_STS_WORD_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_WORD_CNT_MASK) >> SEI_CTRL_CMD_STS_WORD_CNT_SHIFT)

/*
 * BIT_IDX (RO)
 *
 * Bit index
 */
#define SEI_CTRL_CMD_STS_BIT_IDX_MASK (0x1FU)
#define SEI_CTRL_CMD_STS_BIT_IDX_SHIFT (0U)
#define SEI_CTRL_CMD_STS_BIT_IDX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_BIT_IDX_MASK) >> SEI_CTRL_CMD_STS_BIT_IDX_SHIFT)

/* Bitfield definition for register of struct array CTRL: MIN */
/*
 * CMD_MIN (RW)
 *
 * minimum command value
 */
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT) & SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK)
#define SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_MASK) >> SEI_CTRL_CMD_TABLE_MIN_CMD_MIN_SHIFT)

/* Bitfield definition for register of struct array CTRL: MAX */
/*
 * CMD_MAX (RW)
 *
 * maximum command value
 */
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT) & SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK)
#define SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_MASK) >> SEI_CTRL_CMD_TABLE_MAX_CMD_MAX_SHIFT)

/* Bitfield definition for register of struct array CTRL: MSK */
/*
 * CMD_MASK (RW)
 *
 * compare mask
 */
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT) & SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK)
#define SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_MASK) >> SEI_CTRL_CMD_TABLE_MSK_CMD_MASK_SHIFT)

