hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/* Bitfield definition for register of struct array CTRL: PTA */
/*
 * PTR3 (RW)
 *
 * pointer3
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR3_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR3_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR3_SHIFT)

/*
 * PTR2 (RW)
 *
 * pointer2
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK (0xFF0000UL)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT (16U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR2_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR2_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR2_SHIFT)

/*
 * PTR1 (RW)
 *
 * pointer1
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR1_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR1_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR1_SHIFT)

/*
 * PTR0 (RW)
 *
 * pointer0
 */
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT) & SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK)
#define SEI_CTRL_CMD_TABLE_PTA_PTR0_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTA_PTR0_MASK) >> SEI_CTRL_CMD_TABLE_PTA_PTR0_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTB */
/*
 * PTR7 (RW)
 *
 * pointer7
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR7_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR7_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR7_SHIFT)

/*
 * PTR6 (RW)
 *
 * pointer6
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK (0xFF0000UL)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT (16U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR6_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR6_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR6_SHIFT)

/*
 * PTR5 (RW)
 *
 * pointer5
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR5_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR5_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR5_SHIFT)

/*
 * PTR4 (RW)
 *
 * pointer4
 */
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT) & SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK)
#define SEI_CTRL_CMD_TABLE_PTB_PTR4_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTB_PTR4_MASK) >> SEI_CTRL_CMD_TABLE_PTB_PTR4_SHIFT)

/* Bitfield definition for register of struct array CTRL: 0_1 */
/*
 * POINTER (RW)
 *
 * pointer
 */
#define SEI_CTRL_LATCH_TRAN_POINTER_MASK (0xFF000000UL)
#define SEI_CTRL_LATCH_TRAN_POINTER_SHIFT (24U)
#define SEI_CTRL_LATCH_TRAN_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_POINTER_SHIFT) & SEI_CTRL_LATCH_TRAN_POINTER_MASK)
#define SEI_CTRL_LATCH_TRAN_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_POINTER_MASK) >> SEI_CTRL_LATCH_TRAN_POINTER_SHIFT)

/*
 * CFG_TM (RW)
 *
 * timeout
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_TM_MASK (0x30000UL)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT (16U)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_TM_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_TM_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT)

/*
 * CFG_RXD (RW)
 *
 * data received
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK (0xC000U)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT (14U)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT)

/*
 * CFG_TXD (RW)
 *
 * data send
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK (0x3000U)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT (12U)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT)

/*
 * CFG_CLK (RW)
 *
 * clock
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK (0xC00U)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT (10U)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT)

/*
 * CFG_PTR (RW)
 *
 * pointer
 * 0: match
 * 1: not match
 * 2:entry
 * 3:leave
 */
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK (0x300U)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT (8U)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT)

