hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * OV_TM (RW)
 *
 * override timeout check
 */
#define SEI_CTRL_LATCH_TRAN_OV_TM_MASK (0x10U)
#define SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT (4U)
#define SEI_CTRL_LATCH_TRAN_OV_TM_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_TM_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_TM_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_TM_MASK) >> SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT)

/*
 * OV_RXD (RW)
 *
 * override RX data check
 */
#define SEI_CTRL_LATCH_TRAN_OV_RXD_MASK (0x8U)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT (3U)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_RXD_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_RXD_MASK) >> SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT)

/*
 * OV_TXD (RW)
 *
 * override TX data check
 */
#define SEI_CTRL_LATCH_TRAN_OV_TXD_MASK (0x4U)
#define SEI_CTRL_LATCH_TRAN_OV_TXD_SHIFT (2U)
#define SEI_CTRL_LATCH_TRAN_OV_TXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_TXD_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_TXD_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_TXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_TXD_MASK) >> SEI_CTRL_LATCH_TRAN_OV_TXD_SHIFT)

/*
 * OV_CLK (RW)
 *
 * override clock check
 */
#define SEI_CTRL_LATCH_TRAN_OV_CLK_MASK (0x2U)
#define SEI_CTRL_LATCH_TRAN_OV_CLK_SHIFT (1U)
#define SEI_CTRL_LATCH_TRAN_OV_CLK_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_CLK_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_CLK_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_CLK_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_CLK_MASK) >> SEI_CTRL_LATCH_TRAN_OV_CLK_SHIFT)

/*
 * OV_PTR (RW)
 *
 * override pointer check
 */
#define SEI_CTRL_LATCH_TRAN_OV_PTR_MASK (0x1U)
#define SEI_CTRL_LATCH_TRAN_OV_PTR_SHIFT (0U)
#define SEI_CTRL_LATCH_TRAN_OV_PTR_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_PTR_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_PTR_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_PTR_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_PTR_MASK) >> SEI_CTRL_LATCH_TRAN_OV_PTR_SHIFT)

/* Bitfield definition for register of struct array CTRL: CFG */
/*
 * EN (RW)
 *
 * Enable latch
 * 0: disable
 * 1: enable
 */
#define SEI_CTRL_LATCH_CFG_EN_MASK (0x80000000UL)
#define SEI_CTRL_LATCH_CFG_EN_SHIFT (31U)
#define SEI_CTRL_LATCH_CFG_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_CFG_EN_SHIFT) & SEI_CTRL_LATCH_CFG_EN_MASK)
#define SEI_CTRL_LATCH_CFG_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_CFG_EN_MASK) >> SEI_CTRL_LATCH_CFG_EN_SHIFT)

/*
 * SELECT (RW)
 *
 * Output select
 * 0: state0-state1
 * 1: state1-state2
 * 2: state2-state3
 * 3: state3-state0
 */
#define SEI_CTRL_LATCH_CFG_SELECT_MASK (0x7000000UL)
#define SEI_CTRL_LATCH_CFG_SELECT_SHIFT (24U)
#define SEI_CTRL_LATCH_CFG_SELECT_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_CFG_SELECT_SHIFT) & SEI_CTRL_LATCH_CFG_SELECT_MASK)
#define SEI_CTRL_LATCH_CFG_SELECT_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_CFG_SELECT_MASK) >> SEI_CTRL_LATCH_CFG_SELECT_SHIFT)

/*
 * DELAY (RW)
 *
 * Delay in system clock cycle, for state transition
 */
#define SEI_CTRL_LATCH_CFG_DELAY_MASK (0xFFFFU)
#define SEI_CTRL_LATCH_CFG_DELAY_SHIFT (0U)
#define SEI_CTRL_LATCH_CFG_DELAY_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_CFG_DELAY_SHIFT) & SEI_CTRL_LATCH_CFG_DELAY_MASK)
#define SEI_CTRL_LATCH_CFG_DELAY_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_CFG_DELAY_MASK) >> SEI_CTRL_LATCH_CFG_DELAY_SHIFT)

/* Bitfield definition for register of struct array CTRL: TIME */
/*
 * LAT_TIME (RO)
 *
 * Latch time
 */
#define SEI_CTRL_LATCH_TIME_LAT_TIME_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_LATCH_TIME_LAT_TIME_SHIFT (0U)
#define SEI_CTRL_LATCH_TIME_LAT_TIME_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TIME_LAT_TIME_MASK) >> SEI_CTRL_LATCH_TIME_LAT_TIME_SHIFT)

/* Bitfield definition for register of struct array CTRL: STS */
/*
 * STATE (RO)
 *
 * State
 */
#define SEI_CTRL_LATCH_STS_STATE_MASK (0x7000000UL)
#define SEI_CTRL_LATCH_STS_STATE_SHIFT (24U)
#define SEI_CTRL_LATCH_STS_STATE_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_STS_STATE_MASK) >> SEI_CTRL_LATCH_STS_STATE_SHIFT)

/*
 * LAT_CNT (RO)
 *
 * Latch counter
 */
#define SEI_CTRL_LATCH_STS_LAT_CNT_MASK (0xFFFFU)
#define SEI_CTRL_LATCH_STS_LAT_CNT_SHIFT (0U)
#define SEI_CTRL_LATCH_STS_LAT_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_STS_LAT_CNT_MASK) >> SEI_CTRL_LATCH_STS_LAT_CNT_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_EN */
/*
 * ACC_EN (RW)
 *
 * Position include acceleration
 * 0: use acceleration from sample override acceleration register
 * 1: use acceleration from motor group
 */
#define SEI_CTRL_POS_SMP_EN_ACC_EN_MASK (0x80000000UL)
#define SEI_CTRL_POS_SMP_EN_ACC_EN_SHIFT (31U)
#define SEI_CTRL_POS_SMP_EN_ACC_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_ACC_EN_SHIFT) & SEI_CTRL_POS_SMP_EN_ACC_EN_MASK)
#define SEI_CTRL_POS_SMP_EN_ACC_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_ACC_EN_MASK) >> SEI_CTRL_POS_SMP_EN_ACC_EN_SHIFT)

/*
 * ACC_SEL (RW)
 *
 * Data register for acceleration transfer
 */
#define SEI_CTRL_POS_SMP_EN_ACC_SEL_MASK (0x1F000000UL)
#define SEI_CTRL_POS_SMP_EN_ACC_SEL_SHIFT (24U)
#define SEI_CTRL_POS_SMP_EN_ACC_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_ACC_SEL_SHIFT) & SEI_CTRL_POS_SMP_EN_ACC_SEL_MASK)
#define SEI_CTRL_POS_SMP_EN_ACC_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_ACC_SEL_MASK) >> SEI_CTRL_POS_SMP_EN_ACC_SEL_SHIFT)

/*
 * SPD_EN (RW)
 *
 * Position include speed
 * 0: use speed from sample override speed register
 * 1: use speed from motor group
 */
#define SEI_CTRL_POS_SMP_EN_SPD_EN_MASK (0x800000UL)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT (23U)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT) & SEI_CTRL_POS_SMP_EN_SPD_EN_MASK)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_SPD_EN_MASK) >> SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT)

/*
 * SPD_SEL (RW)
 *
 * Data register for speed transfer
 */
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK (0x1F0000UL)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT (16U)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT) & SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK) >> SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT)

