hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * LATCH3 (W1C)
 *
 * Latch3
 */
#define SEI_CTRL_IRQ_INT_FLAG_LATCH3_MASK (0x80000UL)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH3_SHIFT (19U)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH3_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_LATCH3_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_LATCH3_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_LATCH3_MASK) >> SEI_CTRL_IRQ_INT_FLAG_LATCH3_SHIFT)

/*
 * LATCH2 (W1C)
 *
 * Latch2
 */
#define SEI_CTRL_IRQ_INT_FLAG_LATCH2_MASK (0x40000UL)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH2_SHIFT (18U)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH2_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_LATCH2_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_LATCH2_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_LATCH2_MASK) >> SEI_CTRL_IRQ_INT_FLAG_LATCH2_SHIFT)

/*
 * LATCH1 (W1C)
 *
 * Latch1
 */
#define SEI_CTRL_IRQ_INT_FLAG_LATCH1_MASK (0x20000UL)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH1_SHIFT (17U)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH1_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_LATCH1_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_LATCH1_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_LATCH1_MASK) >> SEI_CTRL_IRQ_INT_FLAG_LATCH1_SHIFT)

/*
 * LATCH0 (W1C)
 *
 * Latch0
 */
#define SEI_CTRL_IRQ_INT_FLAG_LATCH0_MASK (0x10000UL)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH0_SHIFT (16U)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH0_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_LATCH0_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_LATCH0_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_LATCH0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_LATCH0_MASK) >> SEI_CTRL_IRQ_INT_FLAG_LATCH0_SHIFT)

/*
 * TIMEOUT (W1C)
 *
 * Timeout
 */
#define SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_MASK (0x2000U)
#define SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_SHIFT (13U)
#define SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TIMEOUT_SHIFT)

/*
 * TRX_ERR (W1C)
 *
 * Transfer error
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_MASK (0x1000U)
#define SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_SHIFT (12U)
#define SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRX_ERR_SHIFT)

/*
 * INSTR1_END (W1C)
 *
 * Instruction 1 end
 */
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_MASK (0x800U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_SHIFT (11U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_MASK) >> SEI_CTRL_IRQ_INT_FLAG_INSTR1_END_SHIFT)

/*
 * INSTR0_END (W1C)
 *
 * Instruction 0 end
 */
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_MASK (0x400U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_SHIFT (10U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_MASK) >> SEI_CTRL_IRQ_INT_FLAG_INSTR0_END_SHIFT)

/*
 * PTR1_END (W1C)
 *
 * Pointer 1 end
 */
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_END_MASK (0x200U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_END_SHIFT (9U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_END_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_PTR1_END_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_PTR1_END_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_PTR1_END_MASK) >> SEI_CTRL_IRQ_INT_FLAG_PTR1_END_SHIFT)

/*
 * PTR0_END (W1C)
 *
 * Pointer 0 end
 */
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_END_MASK (0x100U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_END_SHIFT (8U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_END_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_PTR0_END_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_PTR0_END_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_PTR0_END_MASK) >> SEI_CTRL_IRQ_INT_FLAG_PTR0_END_SHIFT)

/*
 * INSTR1_ST (W1C)
 *
 * Instruction 1 start
 */
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_MASK (0x80U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_SHIFT (7U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_FLAG_INSTR1_ST_SHIFT)

/*
 * INSTR0_ST (W1C)
 *
 * Instruction 0 start
 */
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_MASK (0x40U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_SHIFT (6U)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_FLAG_INSTR0_ST_SHIFT)

/*
 * PTR1_ST (W1C)
 *
 * Pointer 1 start
 */
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_MASK (0x20U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_SHIFT (5U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_FLAG_PTR1_ST_SHIFT)

/*
 * PTR0_ST (W1C)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_FLAG_PTR0_ST_SHIFT)

