hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * PTR1_END (RO)
 *
 * Pointer 1 end
 */
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_MASK (0x200U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_SHIFT (9U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR1_END_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR1_END_SHIFT)

/*
 * PTR0_END (RO)
 *
 * Pointer 0 end
 */
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_MASK (0x100U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_SHIFT (8U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR0_END_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR0_END_SHIFT)

/*
 * INSTR1_ST (RO)
 *
 * Instruction 1 start
 */
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_MASK (0x80U)
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_SHIFT (7U)
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_INSTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_INSTR1_ST_SHIFT)

/*
 * INSTR0_ST (RO)
 *
 * Instruction 0 start
 */
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_MASK (0x40U)
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_SHIFT (6U)
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_INSTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_INSTR0_ST_SHIFT)

/*
 * PTR1_ST (RO)
 *
 * Pointer 1 start
 */
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_MASK (0x20U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_SHIFT (5U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR1_ST_SHIFT)

/*
 * PTR0_ST (RO)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR0_ST_SHIFT)

/*
 * WDOG (RO)
 *
 * Watch dog
 */
#define SEI_CTRL_IRQ_INT_STS_WDOG_MASK (0x4U)
#define SEI_CTRL_IRQ_INT_STS_WDOG_SHIFT (2U)
#define SEI_CTRL_IRQ_INT_STS_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_WDOG_MASK) >> SEI_CTRL_IRQ_INT_STS_WDOG_SHIFT)

/*
 * EXCEPT (RO)
 *
 * Exception
 */
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_MASK (0x2U)
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_SHIFT (1U)
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_EXCEPT_MASK) >> SEI_CTRL_IRQ_INT_STS_EXCEPT_SHIFT)

/*
 * STALL (RO)
 *
 * Stall
 */
#define SEI_CTRL_IRQ_INT_STS_STALL_MASK (0x1U)
#define SEI_CTRL_IRQ_INT_STS_STALL_SHIFT (0U)
#define SEI_CTRL_IRQ_INT_STS_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_STALL_MASK) >> SEI_CTRL_IRQ_INT_STS_STALL_SHIFT)

/* Bitfield definition for register of struct array CTRL: POINTER0 */
/*
 * POINTER (RW)
 *
 * Match pointer 0
 */
#define SEI_CTRL_IRQ_POINTER0_POINTER_MASK (0xFFU)
#define SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT (0U)
#define SEI_CTRL_IRQ_POINTER0_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT) & SEI_CTRL_IRQ_POINTER0_POINTER_MASK)
#define SEI_CTRL_IRQ_POINTER0_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_POINTER0_POINTER_MASK) >> SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT)

/* Bitfield definition for register of struct array CTRL: POINTER1 */
/*
 * POINTER (RW)
 *
 * Match pointer 1
 */
#define SEI_CTRL_IRQ_POINTER1_POINTER_MASK (0xFFU)
#define SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT (0U)
#define SEI_CTRL_IRQ_POINTER1_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT) & SEI_CTRL_IRQ_POINTER1_POINTER_MASK)
#define SEI_CTRL_IRQ_POINTER1_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_POINTER1_POINTER_MASK) >> SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT)

/* Bitfield definition for register of struct array CTRL: INSTR0 */
/*
 * INSTR (RW)
 *
 * Match instruction 0
 */
#define SEI_CTRL_IRQ_INSTR0_INSTR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT (0U)
#define SEI_CTRL_IRQ_INSTR0_INSTR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT) & SEI_CTRL_IRQ_INSTR0_INSTR_MASK)
#define SEI_CTRL_IRQ_INSTR0_INSTR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INSTR0_INSTR_MASK) >> SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT)

/* Bitfield definition for register of struct array CTRL: INSTR1 */
/*
 * INSTR (RW)
 *
 * Match instruction 1
 */
#define SEI_CTRL_IRQ_INSTR1_INSTR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT (0U)
#define SEI_CTRL_IRQ_INSTR1_INSTR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT) & SEI_CTRL_IRQ_INSTR1_INSTR_MASK)
#define SEI_CTRL_IRQ_INSTR1_INSTR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INSTR1_INSTR_MASK) >> SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT)

/* Bitfield definition for register of struct array CTRL: DMA_EN */
/*
 * TRG_ERR3 (RW)
 *
 * Trigger3 failed
 */
#define SEI_CTRL_DMA_EN_TRG_ERR3_MASK (0x80000000UL)
#define SEI_CTRL_DMA_EN_TRG_ERR3_SHIFT (31U)
#define SEI_CTRL_DMA_EN_TRG_ERR3_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRG_ERR3_SHIFT) & SEI_CTRL_DMA_EN_TRG_ERR3_MASK)
#define SEI_CTRL_DMA_EN_TRG_ERR3_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRG_ERR3_MASK) >> SEI_CTRL_DMA_EN_TRG_ERR3_SHIFT)

/*
 * TRG_ERR2 (RW)
 *
 * Trigger2 failed
 */
#define SEI_CTRL_DMA_EN_TRG_ERR2_MASK (0x40000000UL)
#define SEI_CTRL_DMA_EN_TRG_ERR2_SHIFT (30U)
#define SEI_CTRL_DMA_EN_TRG_ERR2_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRG_ERR2_SHIFT) & SEI_CTRL_DMA_EN_TRG_ERR2_MASK)
#define SEI_CTRL_DMA_EN_TRG_ERR2_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRG_ERR2_MASK) >> SEI_CTRL_DMA_EN_TRG_ERR2_SHIFT)

/*
 * TRG_ERR1 (RW)
 *
 * Trigger1 failed
 */
#define SEI_CTRL_DMA_EN_TRG_ERR1_MASK (0x20000000UL)
#define SEI_CTRL_DMA_EN_TRG_ERR1_SHIFT (29U)
#define SEI_CTRL_DMA_EN_TRG_ERR1_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRG_ERR1_SHIFT) & SEI_CTRL_DMA_EN_TRG_ERR1_MASK)
#define SEI_CTRL_DMA_EN_TRG_ERR1_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRG_ERR1_MASK) >> SEI_CTRL_DMA_EN_TRG_ERR1_SHIFT)

/*
 * TRG_ERR0 (RW)
 *
 * Trigger0 failed
 */
#define SEI_CTRL_DMA_EN_TRG_ERR0_MASK (0x10000000UL)
#define SEI_CTRL_DMA_EN_TRG_ERR0_SHIFT (28U)
#define SEI_CTRL_DMA_EN_TRG_ERR0_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRG_ERR0_SHIFT) & SEI_CTRL_DMA_EN_TRG_ERR0_MASK)
#define SEI_CTRL_DMA_EN_TRG_ERR0_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRG_ERR0_MASK) >> SEI_CTRL_DMA_EN_TRG_ERR0_SHIFT)

