hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * TRIGER3 (RW)
 *
 * Trigger3
 */
#define SEI_CTRL_DMA_EN_TRIGER3_MASK (0x8000000UL)
#define SEI_CTRL_DMA_EN_TRIGER3_SHIFT (27U)
#define SEI_CTRL_DMA_EN_TRIGER3_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRIGER3_SHIFT) & SEI_CTRL_DMA_EN_TRIGER3_MASK)
#define SEI_CTRL_DMA_EN_TRIGER3_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRIGER3_MASK) >> SEI_CTRL_DMA_EN_TRIGER3_SHIFT)

/*
 * TRIGER2 (RW)
 *
 * Trigger2
 */
#define SEI_CTRL_DMA_EN_TRIGER2_MASK (0x4000000UL)
#define SEI_CTRL_DMA_EN_TRIGER2_SHIFT (26U)
#define SEI_CTRL_DMA_EN_TRIGER2_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRIGER2_SHIFT) & SEI_CTRL_DMA_EN_TRIGER2_MASK)
#define SEI_CTRL_DMA_EN_TRIGER2_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRIGER2_MASK) >> SEI_CTRL_DMA_EN_TRIGER2_SHIFT)

/*
 * TRIGER1 (RW)
 *
 * Trigger1
 */
#define SEI_CTRL_DMA_EN_TRIGER1_MASK (0x2000000UL)
#define SEI_CTRL_DMA_EN_TRIGER1_SHIFT (25U)
#define SEI_CTRL_DMA_EN_TRIGER1_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRIGER1_SHIFT) & SEI_CTRL_DMA_EN_TRIGER1_MASK)
#define SEI_CTRL_DMA_EN_TRIGER1_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRIGER1_MASK) >> SEI_CTRL_DMA_EN_TRIGER1_SHIFT)

/*
 * TRIGER0 (RW)
 *
 * Trigger0
 */
#define SEI_CTRL_DMA_EN_TRIGER0_MASK (0x1000000UL)
#define SEI_CTRL_DMA_EN_TRIGER0_SHIFT (24U)
#define SEI_CTRL_DMA_EN_TRIGER0_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRIGER0_SHIFT) & SEI_CTRL_DMA_EN_TRIGER0_MASK)
#define SEI_CTRL_DMA_EN_TRIGER0_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRIGER0_MASK) >> SEI_CTRL_DMA_EN_TRIGER0_SHIFT)

/*
 * SMP_ERR (RW)
 *
 * Sample error
 */
#define SEI_CTRL_DMA_EN_SMP_ERR_MASK (0x100000UL)
#define SEI_CTRL_DMA_EN_SMP_ERR_SHIFT (20U)
#define SEI_CTRL_DMA_EN_SMP_ERR_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_SMP_ERR_SHIFT) & SEI_CTRL_DMA_EN_SMP_ERR_MASK)
#define SEI_CTRL_DMA_EN_SMP_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_SMP_ERR_MASK) >> SEI_CTRL_DMA_EN_SMP_ERR_SHIFT)

/*
 * LATCH3 (RW)
 *
 * Latch3
 */
#define SEI_CTRL_DMA_EN_LATCH3_MASK (0x80000UL)
#define SEI_CTRL_DMA_EN_LATCH3_SHIFT (19U)
#define SEI_CTRL_DMA_EN_LATCH3_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_LATCH3_SHIFT) & SEI_CTRL_DMA_EN_LATCH3_MASK)
#define SEI_CTRL_DMA_EN_LATCH3_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_LATCH3_MASK) >> SEI_CTRL_DMA_EN_LATCH3_SHIFT)

/*
 * LATCH2 (RW)
 *
 * Latch2
 */
#define SEI_CTRL_DMA_EN_LATCH2_MASK (0x40000UL)
#define SEI_CTRL_DMA_EN_LATCH2_SHIFT (18U)
#define SEI_CTRL_DMA_EN_LATCH2_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_LATCH2_SHIFT) & SEI_CTRL_DMA_EN_LATCH2_MASK)
#define SEI_CTRL_DMA_EN_LATCH2_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_LATCH2_MASK) >> SEI_CTRL_DMA_EN_LATCH2_SHIFT)

/*
 * LATCH1 (RW)
 *
 * Latch1
 */
#define SEI_CTRL_DMA_EN_LATCH1_MASK (0x20000UL)
#define SEI_CTRL_DMA_EN_LATCH1_SHIFT (17U)
#define SEI_CTRL_DMA_EN_LATCH1_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_LATCH1_SHIFT) & SEI_CTRL_DMA_EN_LATCH1_MASK)
#define SEI_CTRL_DMA_EN_LATCH1_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_LATCH1_MASK) >> SEI_CTRL_DMA_EN_LATCH1_SHIFT)

/*
 * LATCH0 (RW)
 *
 * Latch0
 */
#define SEI_CTRL_DMA_EN_LATCH0_MASK (0x10000UL)
#define SEI_CTRL_DMA_EN_LATCH0_SHIFT (16U)
#define SEI_CTRL_DMA_EN_LATCH0_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_LATCH0_SHIFT) & SEI_CTRL_DMA_EN_LATCH0_MASK)
#define SEI_CTRL_DMA_EN_LATCH0_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_LATCH0_MASK) >> SEI_CTRL_DMA_EN_LATCH0_SHIFT)

/*
 * TIMEOUT (RW)
 *
 * Timeout
 */
#define SEI_CTRL_DMA_EN_TIMEOUT_MASK (0x2000U)
#define SEI_CTRL_DMA_EN_TIMEOUT_SHIFT (13U)
#define SEI_CTRL_DMA_EN_TIMEOUT_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TIMEOUT_SHIFT) & SEI_CTRL_DMA_EN_TIMEOUT_MASK)
#define SEI_CTRL_DMA_EN_TIMEOUT_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TIMEOUT_MASK) >> SEI_CTRL_DMA_EN_TIMEOUT_SHIFT)

/*
 * TRX_ERR (RW)
 *
 * Transfer error
 */
#define SEI_CTRL_DMA_EN_TRX_ERR_MASK (0x1000U)
#define SEI_CTRL_DMA_EN_TRX_ERR_SHIFT (12U)
#define SEI_CTRL_DMA_EN_TRX_ERR_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_TRX_ERR_SHIFT) & SEI_CTRL_DMA_EN_TRX_ERR_MASK)
#define SEI_CTRL_DMA_EN_TRX_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_TRX_ERR_MASK) >> SEI_CTRL_DMA_EN_TRX_ERR_SHIFT)

/*
 * INSTR1_END (RW)
 *
 * Instruction 1 end
 */
#define SEI_CTRL_DMA_EN_INSTR1_END_MASK (0x800U)
#define SEI_CTRL_DMA_EN_INSTR1_END_SHIFT (11U)
#define SEI_CTRL_DMA_EN_INSTR1_END_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_INSTR1_END_SHIFT) & SEI_CTRL_DMA_EN_INSTR1_END_MASK)
#define SEI_CTRL_DMA_EN_INSTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_INSTR1_END_MASK) >> SEI_CTRL_DMA_EN_INSTR1_END_SHIFT)

/*
 * INSTR0_END (RW)
 *
 * Instruction 0 end
 */
#define SEI_CTRL_DMA_EN_INSTR0_END_MASK (0x400U)
#define SEI_CTRL_DMA_EN_INSTR0_END_SHIFT (10U)
#define SEI_CTRL_DMA_EN_INSTR0_END_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_INSTR0_END_SHIFT) & SEI_CTRL_DMA_EN_INSTR0_END_MASK)
#define SEI_CTRL_DMA_EN_INSTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_INSTR0_END_MASK) >> SEI_CTRL_DMA_EN_INSTR0_END_SHIFT)

/*
 * PTR1_END (RW)
 *
 * Pointer 1 end
 */
#define SEI_CTRL_DMA_EN_PTR1_END_MASK (0x200U)
#define SEI_CTRL_DMA_EN_PTR1_END_SHIFT (9U)
#define SEI_CTRL_DMA_EN_PTR1_END_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_PTR1_END_SHIFT) & SEI_CTRL_DMA_EN_PTR1_END_MASK)
#define SEI_CTRL_DMA_EN_PTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_PTR1_END_MASK) >> SEI_CTRL_DMA_EN_PTR1_END_SHIFT)

/*
 * PTR0_END (RW)
 *
 * Pointer 0 end
 */
#define SEI_CTRL_DMA_EN_PTR0_END_MASK (0x100U)
#define SEI_CTRL_DMA_EN_PTR0_END_SHIFT (8U)
#define SEI_CTRL_DMA_EN_PTR0_END_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_PTR0_END_SHIFT) & SEI_CTRL_DMA_EN_PTR0_END_MASK)
#define SEI_CTRL_DMA_EN_PTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_PTR0_END_MASK) >> SEI_CTRL_DMA_EN_PTR0_END_SHIFT)

/*
 * INSTR1_ST (RW)
 *
 * Instruction 1 start
 */
#define SEI_CTRL_DMA_EN_INSTR1_ST_MASK (0x80U)
#define SEI_CTRL_DMA_EN_INSTR1_ST_SHIFT (7U)
#define SEI_CTRL_DMA_EN_INSTR1_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_INSTR1_ST_SHIFT) & SEI_CTRL_DMA_EN_INSTR1_ST_MASK)
#define SEI_CTRL_DMA_EN_INSTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_INSTR1_ST_MASK) >> SEI_CTRL_DMA_EN_INSTR1_ST_SHIFT)

