hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * INSTR0_ST (RW)
 *
 * Instruction 0 start
 */
#define SEI_CTRL_DMA_EN_INSTR0_ST_MASK (0x40U)
#define SEI_CTRL_DMA_EN_INSTR0_ST_SHIFT (6U)
#define SEI_CTRL_DMA_EN_INSTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_INSTR0_ST_SHIFT) & SEI_CTRL_DMA_EN_INSTR0_ST_MASK)
#define SEI_CTRL_DMA_EN_INSTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_INSTR0_ST_MASK) >> SEI_CTRL_DMA_EN_INSTR0_ST_SHIFT)

/*
 * PTR1_ST (RW)
 *
 * Pointer 1 start
 */
#define SEI_CTRL_DMA_EN_PTR1_ST_MASK (0x20U)
#define SEI_CTRL_DMA_EN_PTR1_ST_SHIFT (5U)
#define SEI_CTRL_DMA_EN_PTR1_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_PTR1_ST_SHIFT) & SEI_CTRL_DMA_EN_PTR1_ST_MASK)
#define SEI_CTRL_DMA_EN_PTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_PTR1_ST_MASK) >> SEI_CTRL_DMA_EN_PTR1_ST_SHIFT)

/*
 * PTR0_ST (RW)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_DMA_EN_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_DMA_EN_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_DMA_EN_PTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_PTR0_ST_SHIFT) & SEI_CTRL_DMA_EN_PTR0_ST_MASK)
#define SEI_CTRL_DMA_EN_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_PTR0_ST_MASK) >> SEI_CTRL_DMA_EN_PTR0_ST_SHIFT)

/*
 * WDOG (RW)
 *
 * Watch dog
 */
#define SEI_CTRL_DMA_EN_WDOG_MASK (0x4U)
#define SEI_CTRL_DMA_EN_WDOG_SHIFT (2U)
#define SEI_CTRL_DMA_EN_WDOG_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_WDOG_SHIFT) & SEI_CTRL_DMA_EN_WDOG_MASK)
#define SEI_CTRL_DMA_EN_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_WDOG_MASK) >> SEI_CTRL_DMA_EN_WDOG_SHIFT)

/*
 * EXCEPT (RW)
 *
 * Exception
 */
#define SEI_CTRL_DMA_EN_EXCEPT_MASK (0x2U)
#define SEI_CTRL_DMA_EN_EXCEPT_SHIFT (1U)
#define SEI_CTRL_DMA_EN_EXCEPT_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_EXCEPT_SHIFT) & SEI_CTRL_DMA_EN_EXCEPT_MASK)
#define SEI_CTRL_DMA_EN_EXCEPT_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_EXCEPT_MASK) >> SEI_CTRL_DMA_EN_EXCEPT_SHIFT)

/*
 * STALL (RW)
 *
 * Stall
 */
#define SEI_CTRL_DMA_EN_STALL_MASK (0x1U)
#define SEI_CTRL_DMA_EN_STALL_SHIFT (0U)
#define SEI_CTRL_DMA_EN_STALL_SET(x) (((uint32_t)(x) << SEI_CTRL_DMA_EN_STALL_SHIFT) & SEI_CTRL_DMA_EN_STALL_MASK)
#define SEI_CTRL_DMA_EN_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_DMA_EN_STALL_MASK) >> SEI_CTRL_DMA_EN_STALL_SHIFT)

/* Bitfield definition for register array: INSTR */
/*
 * OP (RW)
 *
 * operation
 * 0: halt
 * 1: jump
 * 2: send with timeout check
 * 3: send without timout check
 * 4: wait with timeout check
 * 5: wait without timout check
 * 6: receive with timeout check
 * 7: receive without timout check
 */
#define SEI_INSTR_OP_MASK (0x1C000000UL)
#define SEI_INSTR_OP_SHIFT (26U)
#define SEI_INSTR_OP_SET(x) (((uint32_t)(x) << SEI_INSTR_OP_SHIFT) & SEI_INSTR_OP_MASK)
#define SEI_INSTR_OP_GET(x) (((uint32_t)(x) & SEI_INSTR_OP_MASK) >> SEI_INSTR_OP_SHIFT)

/*
 * CK (RW)
 *
 * clock state configure
 * a. In synchronous master mode:
 * 0: low
 * 1: rise-fall
 * 2: fall-rise
 * 3: high
 * b. In synchronous slave mode:
 * 0：Use TX_POINT and RX_POINT as the timing for data transmission and reception. Disable the TIMEOUT function in the communication protocol( this is not WDG).
 * 1：Switch the timing for data transmission and reception (e.g., switching edges for receive/transmit in an EnDat Encoder communication cycle). Disable the TIMEOUT function in the communication protocol.
 * 2：Use TX_POINT and RX_POINT as the timing for data transmission and reception；Enable the TIMEOUT function in the communication protocol.
 * 3：Switch the timing for data transmission and reception. Enable the TIMEOUT function in the communication protocol.
 * c.  In asynchronous mode: please keep 0.
 */
#define SEI_INSTR_CK_MASK (0x3000000UL)
#define SEI_INSTR_CK_SHIFT (24U)
#define SEI_INSTR_CK_SET(x) (((uint32_t)(x) << SEI_INSTR_CK_SHIFT) & SEI_INSTR_CK_MASK)
#define SEI_INSTR_CK_GET(x) (((uint32_t)(x) & SEI_INSTR_CK_MASK) >> SEI_INSTR_CK_SHIFT)

/*
 * CRC (RW)
 *
 * CRC register
 * 0: don't calculate CRC
 * 1: do not set this value
 * 2: data register 2
 * 3: data register 3
 * ...
 * 29: data register 29
 * 30: do not set this value
 * 31: do not set this value
 */
#define SEI_INSTR_CRC_MASK (0x1F0000UL)
#define SEI_INSTR_CRC_SHIFT (16U)
#define SEI_INSTR_CRC_SET(x) (((uint32_t)(x) << SEI_INSTR_CRC_SHIFT) & SEI_INSTR_CRC_MASK)
#define SEI_INSTR_CRC_GET(x) (((uint32_t)(x) & SEI_INSTR_CRC_MASK) >> SEI_INSTR_CRC_SHIFT)

/*
 * DAT (RW)
 *
 * DATA register
 * 0: ignore data
 * 1: command
 * 2: data register 2
 * 3: data register 3
 * ...
 * 29: data register 29
 * 30: value 0 when send, wait 0 in receive
 * 31: value1 when send,  wait 1 in receive
 */
#define SEI_INSTR_DAT_MASK (0x1F00U)
#define SEI_INSTR_DAT_SHIFT (8U)
#define SEI_INSTR_DAT_SET(x) (((uint32_t)(x) << SEI_INSTR_DAT_SHIFT) & SEI_INSTR_DAT_MASK)
#define SEI_INSTR_DAT_GET(x) (((uint32_t)(x) & SEI_INSTR_DAT_MASK) >> SEI_INSTR_DAT_SHIFT)

/*
 * OPR (RW)
 *
 * a. When OP is 0, this area is the halt time in baudrate, 0 represents infinite time.
 * b. When OP is 1, this area is the the pointer to the command table.
 * OPR[4]=1, OPR[3:0] value is CMD_TABLE instruct pointer;
 * OPR[4]=0, OPR[3:0]=0 is INIT_POINTER;
 * OPR[4]=0, OPR[3:0]=1 is WDG_POINTER.
 * c. When OP is 2-7, this area is the data length as fellow:
 * 0: 1 bit
 * 1: 2 bit
 *  ...
 * 31: 32 bit
 */
#define SEI_INSTR_OPR_MASK (0x1FU)
#define SEI_INSTR_OPR_SHIFT (0U)
#define SEI_INSTR_OPR_SET(x) (((uint32_t)(x) << SEI_INSTR_OPR_SHIFT) & SEI_INSTR_OPR_MASK)
#define SEI_INSTR_OPR_GET(x) (((uint32_t)(x) & SEI_INSTR_OPR_MASK) >> SEI_INSTR_OPR_SHIFT)

/* Bitfield definition for register of struct array DAT: MODE */
/*
 * CRC_LEN (RW)
 *
 * CRC length
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 31: 32 bit
 */
#define SEI_DAT_MODE_CRC_LEN_MASK (0x1F000000UL)
#define SEI_DAT_MODE_CRC_LEN_SHIFT (24U)
#define SEI_DAT_MODE_CRC_LEN_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_CRC_LEN_SHIFT) & SEI_DAT_MODE_CRC_LEN_MASK)
#define SEI_DAT_MODE_CRC_LEN_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_CRC_LEN_MASK) >> SEI_DAT_MODE_CRC_LEN_SHIFT)

/*
 * WLEN (RW)
 *
 * word length
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 31: 32 bit
 */
#define SEI_DAT_MODE_WLEN_MASK (0x1F0000UL)
#define SEI_DAT_MODE_WLEN_SHIFT (16U)
#define SEI_DAT_MODE_WLEN_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_WLEN_SHIFT) & SEI_DAT_MODE_WLEN_MASK)
#define SEI_DAT_MODE_WLEN_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_WLEN_MASK) >> SEI_DAT_MODE_WLEN_SHIFT)

