hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/*
 * CRC_SHIFT (RW)
 *
 * CRC shift mode, this mode is used to perform repeat code check
 * 0: CRC
 * 1: shift mode
 */
#define SEI_DAT_MODE_CRC_SHIFT_MASK (0x2000U)
#define SEI_DAT_MODE_CRC_SHIFT_SHIFT (13U)
#define SEI_DAT_MODE_CRC_SHIFT_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_CRC_SHIFT_SHIFT) & SEI_DAT_MODE_CRC_SHIFT_MASK)
#define SEI_DAT_MODE_CRC_SHIFT_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_CRC_SHIFT_MASK) >> SEI_DAT_MODE_CRC_SHIFT_SHIFT)

/*
 * CRC_INV (RW)
 *
 * CRC invert
 * 0: use CRC
 * 1: use inverted CRC
 */
#define SEI_DAT_MODE_CRC_INV_MASK (0x1000U)
#define SEI_DAT_MODE_CRC_INV_SHIFT (12U)
#define SEI_DAT_MODE_CRC_INV_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_CRC_INV_SHIFT) & SEI_DAT_MODE_CRC_INV_MASK)
#define SEI_DAT_MODE_CRC_INV_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_CRC_INV_MASK) >> SEI_DAT_MODE_CRC_INV_SHIFT)

/*
 * WORDER (RW)
 *
 * word order
 * 0: sample as bit order
 * 1: different from bit order
 */
#define SEI_DAT_MODE_WORDER_MASK (0x800U)
#define SEI_DAT_MODE_WORDER_SHIFT (11U)
#define SEI_DAT_MODE_WORDER_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_WORDER_SHIFT) & SEI_DAT_MODE_WORDER_MASK)
#define SEI_DAT_MODE_WORDER_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_WORDER_MASK) >> SEI_DAT_MODE_WORDER_SHIFT)

/*
 * BORDER (RW)
 *
 * bit order
 * 0: LSB first
 * 1: MSB first
 */
#define SEI_DAT_MODE_BORDER_MASK (0x400U)
#define SEI_DAT_MODE_BORDER_SHIFT (10U)
#define SEI_DAT_MODE_BORDER_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_BORDER_SHIFT) & SEI_DAT_MODE_BORDER_MASK)
#define SEI_DAT_MODE_BORDER_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_BORDER_MASK) >> SEI_DAT_MODE_BORDER_SHIFT)

/*
 * SIGNED (RW)
 *
 * Signed
 * 0: unsigned value
 * 1: signed value
 */
#define SEI_DAT_MODE_SIGNED_MASK (0x200U)
#define SEI_DAT_MODE_SIGNED_SHIFT (9U)
#define SEI_DAT_MODE_SIGNED_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_SIGNED_SHIFT) & SEI_DAT_MODE_SIGNED_MASK)
#define SEI_DAT_MODE_SIGNED_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_SIGNED_MASK) >> SEI_DAT_MODE_SIGNED_SHIFT)

/*
 * REWIND (RW)
 *
 * Write 1 to rewind read/write pointer, this is a self clear bit
 */
#define SEI_DAT_MODE_REWIND_MASK (0x100U)
#define SEI_DAT_MODE_REWIND_SHIFT (8U)
#define SEI_DAT_MODE_REWIND_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_REWIND_SHIFT) & SEI_DAT_MODE_REWIND_MASK)
#define SEI_DAT_MODE_REWIND_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_REWIND_MASK) >> SEI_DAT_MODE_REWIND_SHIFT)

/*
 * MODE (RW)
 *
 * Data mode
 * 0: data mode
 * 1: check mode
 * 2: CRC mode
 */
#define SEI_DAT_MODE_MODE_MASK (0x3U)
#define SEI_DAT_MODE_MODE_SHIFT (0U)
#define SEI_DAT_MODE_MODE_SET(x) (((uint32_t)(x) << SEI_DAT_MODE_MODE_SHIFT) & SEI_DAT_MODE_MODE_MASK)
#define SEI_DAT_MODE_MODE_GET(x) (((uint32_t)(x) & SEI_DAT_MODE_MODE_MASK) >> SEI_DAT_MODE_MODE_SHIFT)

/* Bitfield definition for register of struct array DAT: IDX */
/*
 * LAST_BIT (RW)
 *
 * Last bit index for tranceive
 */
#define SEI_DAT_IDX_LAST_BIT_MASK (0x1F000000UL)
#define SEI_DAT_IDX_LAST_BIT_SHIFT (24U)
#define SEI_DAT_IDX_LAST_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_LAST_BIT_SHIFT) & SEI_DAT_IDX_LAST_BIT_MASK)
#define SEI_DAT_IDX_LAST_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_LAST_BIT_MASK) >> SEI_DAT_IDX_LAST_BIT_SHIFT)

/*
 * FIRST_BIT (RW)
 *
 * First bit index for tranceive
 */
#define SEI_DAT_IDX_FIRST_BIT_MASK (0x1F0000UL)
#define SEI_DAT_IDX_FIRST_BIT_SHIFT (16U)
#define SEI_DAT_IDX_FIRST_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_FIRST_BIT_SHIFT) & SEI_DAT_IDX_FIRST_BIT_MASK)
#define SEI_DAT_IDX_FIRST_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_FIRST_BIT_MASK) >> SEI_DAT_IDX_FIRST_BIT_SHIFT)

/*
 * MAX_BIT (RW)
 *
 * Highest bit index
 */
#define SEI_DAT_IDX_MAX_BIT_MASK (0x1F00U)
#define SEI_DAT_IDX_MAX_BIT_SHIFT (8U)
#define SEI_DAT_IDX_MAX_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_MAX_BIT_SHIFT) & SEI_DAT_IDX_MAX_BIT_MASK)
#define SEI_DAT_IDX_MAX_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_MAX_BIT_MASK) >> SEI_DAT_IDX_MAX_BIT_SHIFT)

/*
 * MIN_BIT (RW)
 *
 * Lowest bit index
 */
#define SEI_DAT_IDX_MIN_BIT_MASK (0x1FU)
#define SEI_DAT_IDX_MIN_BIT_SHIFT (0U)
#define SEI_DAT_IDX_MIN_BIT_SET(x) (((uint32_t)(x) << SEI_DAT_IDX_MIN_BIT_SHIFT) & SEI_DAT_IDX_MIN_BIT_MASK)
#define SEI_DAT_IDX_MIN_BIT_GET(x) (((uint32_t)(x) & SEI_DAT_IDX_MIN_BIT_MASK) >> SEI_DAT_IDX_MIN_BIT_SHIFT)

/* Bitfield definition for register of struct array DAT: GOLD */
/*
 * GOLD_VALUE (RW)
 *
 * Gold value for check mode
 */
#define SEI_DAT_GOLD_GOLD_VALUE_MASK (0xFFFFFFFFUL)
#define SEI_DAT_GOLD_GOLD_VALUE_SHIFT (0U)
#define SEI_DAT_GOLD_GOLD_VALUE_SET(x) (((uint32_t)(x) << SEI_DAT_GOLD_GOLD_VALUE_SHIFT) & SEI_DAT_GOLD_GOLD_VALUE_MASK)
#define SEI_DAT_GOLD_GOLD_VALUE_GET(x) (((uint32_t)(x) & SEI_DAT_GOLD_GOLD_VALUE_MASK) >> SEI_DAT_GOLD_GOLD_VALUE_SHIFT)

/* Bitfield definition for register of struct array DAT: CRCINIT */
/*
 * CRC_INIT (RW)
 *
 * CRC initial value
 */
#define SEI_DAT_CRCINIT_CRC_INIT_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CRCINIT_CRC_INIT_SHIFT (0U)
#define SEI_DAT_CRCINIT_CRC_INIT_SET(x) (((uint32_t)(x) << SEI_DAT_CRCINIT_CRC_INIT_SHIFT) & SEI_DAT_CRCINIT_CRC_INIT_MASK)
#define SEI_DAT_CRCINIT_CRC_INIT_GET(x) (((uint32_t)(x) & SEI_DAT_CRCINIT_CRC_INIT_MASK) >> SEI_DAT_CRCINIT_CRC_INIT_SHIFT)

/* Bitfield definition for register of struct array DAT: CRCPOLY */
/*
 * CRC_POLY (RW)
 *
 * CRC polymonial
 */
#define SEI_DAT_CRCPOLY_CRC_POLY_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CRCPOLY_CRC_POLY_SHIFT (0U)
#define SEI_DAT_CRCPOLY_CRC_POLY_SET(x) (((uint32_t)(x) << SEI_DAT_CRCPOLY_CRC_POLY_SHIFT) & SEI_DAT_CRCPOLY_CRC_POLY_MASK)
#define SEI_DAT_CRCPOLY_CRC_POLY_GET(x) (((uint32_t)(x) & SEI_DAT_CRCPOLY_CRC_POLY_MASK) >> SEI_DAT_CRCPOLY_CRC_POLY_SHIFT)

/* Bitfield definition for register of struct array DAT: DATA */
/*
 * DATA (RW)
 *
 * DATA
 */
#define SEI_DAT_DATA_DATA_MASK (0xFFFFFFFFUL)
#define SEI_DAT_DATA_DATA_SHIFT (0U)
#define SEI_DAT_DATA_DATA_SET(x) (((uint32_t)(x) << SEI_DAT_DATA_DATA_SHIFT) & SEI_DAT_DATA_DATA_MASK)
#define SEI_DAT_DATA_DATA_GET(x) (((uint32_t)(x) & SEI_DAT_DATA_DATA_MASK) >> SEI_DAT_DATA_DATA_SHIFT)

/* Bitfield definition for register of struct array DAT: SET */
/*
 * DATA_SET (RW)
 *
 * DATA bit set
 */
#define SEI_DAT_SET_DATA_SET_MASK (0xFFFFFFFFUL)
#define SEI_DAT_SET_DATA_SET_SHIFT (0U)
#define SEI_DAT_SET_DATA_SET_SET(x) (((uint32_t)(x) << SEI_DAT_SET_DATA_SET_SHIFT) & SEI_DAT_SET_DATA_SET_MASK)
#define SEI_DAT_SET_DATA_SET_GET(x) (((uint32_t)(x) & SEI_DAT_SET_DATA_SET_MASK) >> SEI_DAT_SET_DATA_SET_SHIFT)

