hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sei_regs.h
/* Bitfield definition for register of struct array DAT: CLR */
/*
 * DATA_CLR (RW)
 *
 * DATA bit clear
 */
#define SEI_DAT_CLR_DATA_CLR_MASK (0xFFFFFFFFUL)
#define SEI_DAT_CLR_DATA_CLR_SHIFT (0U)
#define SEI_DAT_CLR_DATA_CLR_SET(x) (((uint32_t)(x) << SEI_DAT_CLR_DATA_CLR_SHIFT) & SEI_DAT_CLR_DATA_CLR_MASK)
#define SEI_DAT_CLR_DATA_CLR_GET(x) (((uint32_t)(x) & SEI_DAT_CLR_DATA_CLR_MASK) >> SEI_DAT_CLR_DATA_CLR_SHIFT)

/* Bitfield definition for register of struct array DAT: INV */
/*
 * DATA_INV (RW)
 *
 * DATA bit toggle
 */
#define SEI_DAT_INV_DATA_INV_MASK (0xFFFFFFFFUL)
#define SEI_DAT_INV_DATA_INV_SHIFT (0U)
#define SEI_DAT_INV_DATA_INV_SET(x) (((uint32_t)(x) << SEI_DAT_INV_DATA_INV_SHIFT) & SEI_DAT_INV_DATA_INV_MASK)
#define SEI_DAT_INV_DATA_INV_GET(x) (((uint32_t)(x) & SEI_DAT_INV_DATA_INV_MASK) >> SEI_DAT_INV_DATA_INV_SHIFT)

/* Bitfield definition for register of struct array DAT: IN */
/*
 * DATA_IN (RO)
 *
 * Data input
 */
#define SEI_DAT_IN_DATA_IN_MASK (0xFFFFFFFFUL)
#define SEI_DAT_IN_DATA_IN_SHIFT (0U)
#define SEI_DAT_IN_DATA_IN_GET(x) (((uint32_t)(x) & SEI_DAT_IN_DATA_IN_MASK) >> SEI_DAT_IN_DATA_IN_SHIFT)

/* Bitfield definition for register of struct array DAT: OUT */
/*
 * DATA_OUT (RO)
 *
 * Data output
 */
#define SEI_DAT_OUT_DATA_OUT_MASK (0xFFFFFFFFUL)
#define SEI_DAT_OUT_DATA_OUT_SHIFT (0U)
#define SEI_DAT_OUT_DATA_OUT_GET(x) (((uint32_t)(x) & SEI_DAT_OUT_DATA_OUT_MASK) >> SEI_DAT_OUT_DATA_OUT_SHIFT)

/* Bitfield definition for register of struct array DAT: STS */
/*
 * CRC_IDX (RO)
 *
 * CRC index
 */
#define SEI_DAT_STS_CRC_IDX_MASK (0x1F000000UL)
#define SEI_DAT_STS_CRC_IDX_SHIFT (24U)
#define SEI_DAT_STS_CRC_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_CRC_IDX_MASK) >> SEI_DAT_STS_CRC_IDX_SHIFT)

/*
 * WORD_IDX (RO)
 *
 * Word index
 */
#define SEI_DAT_STS_WORD_IDX_MASK (0x1F0000UL)
#define SEI_DAT_STS_WORD_IDX_SHIFT (16U)
#define SEI_DAT_STS_WORD_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_WORD_IDX_MASK) >> SEI_DAT_STS_WORD_IDX_SHIFT)

/*
 * WORD_CNT (RO)
 *
 * Word counter
 */
#define SEI_DAT_STS_WORD_CNT_MASK (0x1F00U)
#define SEI_DAT_STS_WORD_CNT_SHIFT (8U)
#define SEI_DAT_STS_WORD_CNT_GET(x) (((uint32_t)(x) & SEI_DAT_STS_WORD_CNT_MASK) >> SEI_DAT_STS_WORD_CNT_SHIFT)

/*
 * BIT_IDX (RO)
 *
 * Bit index
 */
#define SEI_DAT_STS_BIT_IDX_MASK (0x1FU)
#define SEI_DAT_STS_BIT_IDX_SHIFT (0U)
#define SEI_DAT_STS_BIT_IDX_GET(x) (((uint32_t)(x) & SEI_DAT_STS_BIT_IDX_MASK) >> SEI_DAT_STS_BIT_IDX_SHIFT)



/* CMD register group index macro definition */
#define SEI_CTRL_TRG_TABLE_CMD_0 (0UL)
#define SEI_CTRL_TRG_TABLE_CMD_1 (1UL)
#define SEI_CTRL_TRG_TABLE_CMD_2 (2UL)
#define SEI_CTRL_TRG_TABLE_CMD_3 (3UL)

/* TIME register group index macro definition */
#define SEI_CTRL_TRG_TABLE_TIME_0 (0UL)
#define SEI_CTRL_TRG_TABLE_TIME_1 (1UL)
#define SEI_CTRL_TRG_TABLE_TIME_2 (2UL)
#define SEI_CTRL_TRG_TABLE_TIME_3 (3UL)

/* CMD_TABLE register group index macro definition */
#define SEI_CMD_TABLE_0 (0UL)
#define SEI_CMD_TABLE_1 (1UL)
#define SEI_CMD_TABLE_2 (2UL)
#define SEI_CMD_TABLE_3 (3UL)
#define SEI_CMD_TABLE_4 (4UL)
#define SEI_CMD_TABLE_5 (5UL)
#define SEI_CMD_TABLE_6 (6UL)
#define SEI_CMD_TABLE_7 (7UL)

/* TRAN register group index macro definition */
#define SEI_CTRL_LATCH_TRAN_0_1 (0UL)
#define SEI_CTRL_LATCH_TRAN_1_2 (1UL)
#define SEI_CTRL_LATCH_TRAN_2_3 (2UL)
#define SEI_CTRL_LATCH_TRAN_3_0 (3UL)

/* LATCH register group index macro definition */
#define SEI_LATCH_0 (0UL)
#define SEI_LATCH_1 (1UL)
#define SEI_LATCH_2 (2UL)
#define SEI_LATCH_3 (3UL)

/* CTRL register group index macro definition */
#define SEI_CTRL_0 (0UL)
#define SEI_CTRL_1 (1UL)

/* INSTR register group index macro definition */
#define SEI_INSTR_0 (0UL)
#define SEI_INSTR_1 (1UL)
#define SEI_INSTR_2 (2UL)
#define SEI_INSTR_3 (3UL)
#define SEI_INSTR_4 (4UL)
#define SEI_INSTR_5 (5UL)
#define SEI_INSTR_6 (6UL)
#define SEI_INSTR_7 (7UL)
#define SEI_INSTR_8 (8UL)
#define SEI_INSTR_9 (9UL)
#define SEI_INSTR_10 (10UL)
#define SEI_INSTR_11 (11UL)
#define SEI_INSTR_12 (12UL)
#define SEI_INSTR_13 (13UL)
#define SEI_INSTR_14 (14UL)
#define SEI_INSTR_15 (15UL)
#define SEI_INSTR_16 (16UL)
#define SEI_INSTR_17 (17UL)
#define SEI_INSTR_18 (18UL)
#define SEI_INSTR_19 (19UL)
#define SEI_INSTR_20 (20UL)
#define SEI_INSTR_21 (21UL)
#define SEI_INSTR_22 (22UL)
#define SEI_INSTR_23 (23UL)
#define SEI_INSTR_24 (24UL)
#define SEI_INSTR_25 (25UL)
#define SEI_INSTR_26 (26UL)
#define SEI_INSTR_27 (27UL)
#define SEI_INSTR_28 (28UL)
#define SEI_INSTR_29 (29UL)
#define SEI_INSTR_30 (30UL)
#define SEI_INSTR_31 (31UL)
#define SEI_INSTR_32 (32UL)
#define SEI_INSTR_33 (33UL)
#define SEI_INSTR_34 (34UL)
#define SEI_INSTR_35 (35UL)
#define SEI_INSTR_36 (36UL)
#define SEI_INSTR_37 (37UL)
#define SEI_INSTR_38 (38UL)
#define SEI_INSTR_39 (39UL)
#define SEI_INSTR_40 (40UL)
#define SEI_INSTR_41 (41UL)
#define SEI_INSTR_42 (42UL)
#define SEI_INSTR_43 (43UL)
#define SEI_INSTR_44 (44UL)
#define SEI_INSTR_45 (45UL)
#define SEI_INSTR_46 (46UL)
#define SEI_INSTR_47 (47UL)
#define SEI_INSTR_48 (48UL)
#define SEI_INSTR_49 (49UL)
#define SEI_INSTR_50 (50UL)
#define SEI_INSTR_51 (51UL)
#define SEI_INSTR_52 (52UL)
#define SEI_INSTR_53 (53UL)
#define SEI_INSTR_54 (54UL)
#define SEI_INSTR_55 (55UL)
#define SEI_INSTR_56 (56UL)
#define SEI_INSTR_57 (57UL)
#define SEI_INSTR_58 (58UL)
#define SEI_INSTR_59 (59UL)
#define SEI_INSTR_60 (60UL)
#define SEI_INSTR_61 (61UL)
#define SEI_INSTR_62 (62UL)
#define SEI_INSTR_63 (63UL)
#define SEI_INSTR_64 (64UL)
#define SEI_INSTR_65 (65UL)
#define SEI_INSTR_66 (66UL)
#define SEI_INSTR_67 (67UL)
#define SEI_INSTR_68 (68UL)
#define SEI_INSTR_69 (69UL)
#define SEI_INSTR_70 (70UL)
#define SEI_INSTR_71 (71UL)
#define SEI_INSTR_72 (72UL)
#define SEI_INSTR_73 (73UL)
#define SEI_INSTR_74 (74UL)
#define SEI_INSTR_75 (75UL)
#define SEI_INSTR_76 (76UL)
#define SEI_INSTR_77 (77UL)
#define SEI_INSTR_78 (78UL)
#define SEI_INSTR_79 (79UL)
#define SEI_INSTR_80 (80UL)
#define SEI_INSTR_81 (81UL)
#define SEI_INSTR_82 (82UL)
#define SEI_INSTR_83 (83UL)
#define SEI_INSTR_84 (84UL)
#define SEI_INSTR_85 (85UL)
#define SEI_INSTR_86 (86UL)
#define SEI_INSTR_87 (87UL)
#define SEI_INSTR_88 (88UL)
#define SEI_INSTR_89 (89UL)
#define SEI_INSTR_90 (90UL)
#define SEI_INSTR_91 (91UL)
#define SEI_INSTR_92 (92UL)
#define SEI_INSTR_93 (93UL)
#define SEI_INSTR_94 (94UL)
#define SEI_INSTR_95 (95UL)
#define SEI_INSTR_96 (96UL)
#define SEI_INSTR_97 (97UL)
#define SEI_INSTR_98 (98UL)
#define SEI_INSTR_99 (99UL)
#define SEI_INSTR_100 (100UL)
#define SEI_INSTR_101 (101UL)
#define SEI_INSTR_102 (102UL)
#define SEI_INSTR_103 (103UL)
#define SEI_INSTR_104 (104UL)
#define SEI_INSTR_105 (105UL)
#define SEI_INSTR_106 (106UL)
#define SEI_INSTR_107 (107UL)
#define SEI_INSTR_108 (108UL)
#define SEI_INSTR_109 (109UL)
#define SEI_INSTR_110 (110UL)
#define SEI_INSTR_111 (111UL)
#define SEI_INSTR_112 (112UL)
#define SEI_INSTR_113 (113UL)
#define SEI_INSTR_114 (114UL)
#define SEI_INSTR_115 (115UL)
#define SEI_INSTR_116 (116UL)
#define SEI_INSTR_117 (117UL)
#define SEI_INSTR_118 (118UL)
#define SEI_INSTR_119 (119UL)
#define SEI_INSTR_120 (120UL)
#define SEI_INSTR_121 (121UL)
#define SEI_INSTR_122 (122UL)
#define SEI_INSTR_123 (123UL)
#define SEI_INSTR_124 (124UL)
#define SEI_INSTR_125 (125UL)
#define SEI_INSTR_126 (126UL)
#define SEI_INSTR_127 (127UL)

/* DAT register group index macro definition */
#define SEI_DAT_0 (0UL)
#define SEI_DAT_1 (1UL)
#define SEI_DAT_2 (2UL)
#define SEI_DAT_3 (3UL)
#define SEI_DAT_4 (4UL)
#define SEI_DAT_5 (5UL)
#define SEI_DAT_6 (6UL)
#define SEI_DAT_7 (7UL)
#define SEI_DAT_8 (8UL)
#define SEI_DAT_9 (9UL)
#define SEI_DAT_10 (10UL)
#define SEI_DAT_11 (11UL)
#define SEI_DAT_12 (12UL)
#define SEI_DAT_13 (13UL)
#define SEI_DAT_14 (14UL)
#define SEI_DAT_15 (15UL)
#define SEI_DAT_16 (16UL)
#define SEI_DAT_17 (17UL)


#endif /* HPM_SEI_H */
